tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

# self-documenting... Lines that begin with `#-` will be injected into the README.md file

#- [Yet Another Dotfiles Manager](https://yadm.io)
brew "yadm"

# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"

#- [mas](https://github.com/mas-cli/mas) - Mac App Store command line interface
brew "mas"

#- [KeepingYouAwake](https://github.com/newmarcel/KeepingYouAwake/) - Prevents your Mac from going to sleep.
cask "keepingyouawake"

#- [ShiftIt](https://github.com/fikovnik/ShiftIt/) - Window manager
cask "shiftit"

#- [Flycut](https://github.com/TermiT/Flycut) - Clipboard manager
cask "flycut"

# Chrome
cask "google-chrome"

# Firefox
cask "firefox"

#- [Muzzle](https://muzzleapp.com) - Silence notifications when screen sharing
cask "muzzle"

#- [Time Out](https://www.dejal.com/timeout/) - Remind yourself to take a break
cask "time-out"

#- [Notion](https://www.notion.so/product) - Our corporate notebook of memories
cask "notion"

#- [Slack](https://slack.com) - Chit chats on the internets
cask "slack"

#- [Logitech Control Center](https://support.logitech.com/en_us/product/3129)
# cask "logitech-control-center" Can't be installed via brewfiles

#- [Zoom US](https://www.zoom.us/) - We default to Zoom for video conferencing
cask "zoomus"

#- [Calibre](https://calibre-ebook.com) - One stop E-book manager
cask "calibre"

#- [Google Drive](https://cloud.google.com/drive-enterprise)
cask "google-drive-file-stream"
