tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# self-documenting... Lines that begin with `#-` will be injected into the README.md file

#- [CircleCI](https://circleci.com) - Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Distributed revision control system
brew "git"
#- [Hub](https://github.com/github/hub) - Add GitHub support to git on the command-line
brew "hub"
# Command-line JSON pretty-printer
brew "jsonpp"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
#- [postgresql](https://postgresql.org) - Object-relational database system
brew "postgresql", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
#- [redis](https://redis.org) - Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
#- [yarn](https://yarnpkg.com) - JavaScript package manager
brew "yarn"
#- [zsh](https://zsh.sourceforge.net) - UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
#- [Yet Another Dotfiles Manager](https://yadm.io)
brew "yadm"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Executes a program periodically, showing output fullscreen
brew "watch"
#- [mas](https://github.com/mas-cli/mas) Mac App Store command line interface
brew "mas"

#- [Docker](https://docker.com) - Docker Community Edition (.app)
cask "docker"
#- [KeepingYouAwake](https://github.com/newmarcel/KeepingYouAwake/) - Prevents your Mac from going to sleep.
cask "keepingyouawake"
#- [Divvy](https://mizage.com/divvy/) - Window manager
cask "divvy"
#- [Flycut](https://github.com/TermiT/Flycut) - Clipboard manager
cask "flycut"
# Chrome
cask "google-chrome"
# Firefox
cask "firefox"
# Atom
cask "atom"
# [Visual Studio Code](https://code.visualstudio.com) - -Integrated development environment for many languages and platforms with many plugins
cask "visual-studio-code"
#- [Muzzle](https://muzzleapp.com) - -Silence notifications when screen sharing
cask "muzzle"
#- [Time Out](https://www.dejal.com/timeout/) - Remind yourself to take a break
cask "time-out"
#- [Notion](https://www.notion.so/product) Our corporate notebook of memories
cask "notion"
#- [Slack](https://slack.com) - Chit chat on the internets
cask "slack"
#- [JetBrains Toolbox](https://www.jetbrains.com/toolbox/app/) - One stop shopping for the best IDEs
cask "jetbrains-toolbox"
#- [Logitech Control Center](https://support.logitech.com/en_us/product/3129)
cask "logitech-control-center"

#- Font [Inconsolata](https://fonts.google.com/specimen/Inconsolata) - Ralph Levien
cask "font-inconsolata"
#- Font [Anonymous Pro](https://www.marksimonson.com/fonts/view/anonymous-pro) - Mark Simonson
cask "font-anonymous-pro"